In [2]:
print('Hello World!')    # Shift Enter

Hello World!

In [3]:
num1 = 47
num2 = 53
add = num1 + num2
print('Addition is', add)

Addition is 100

In [4]:
type(num1)

int

In [5]:
num1= 67.4
type(num1)

float

##### List Operations

In [6]:
num = [45, 43, 12, 78.9, "Pune", 28]

In [7]:
type(num)

list

In [8]:
num[3]

78.9

##### Array Operations

In [10]:
import numpy as np

In [11]:
x = np.array([56, 23, 11, 76, 49, 82, 37])

In [12]:
x

array([56, 23, 11, 76, 49, 82, 37])

In [13]:
x[4]

49

In [14]:
x * 2

array([112,  46,  22, 152,  98, 164,  74])

In [15]:
x.max()

82

In [16]:
x.mean()

47.714285714285715

##### Series Data Operations

In [18]:
import pandas as pd

In [19]:
s = pd.Series([34, 12, 37, 65, 27, 82, 59])

In [20]:
s

0    34
1    12
2    37
3    65
4    27
5    82
6    59
dtype: int64

##### DataFrame

In [22]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series(['amar','nita','raj','priya','akash'])
s3 = pd.Series([56.90,  67.87,  72.56,  61.05,  77.83])

In [23]:
df = pd.DataFrame({
    'roll': s1,
    'name': s2,
    'marks': s3
})

In [24]:
df

   roll   name  marks
0     1   amar  56.90
1     2   nita  67.87
2     3    raj  72.56
3     4  priya  61.05
4     5  akash  77.83

##### Data Operations

In [ ]:
Location->   https://mitu.co.in/dataset
Download->   student.csv

In [26]:
import os
os.getcwd()

'/home/mitu/pcp-3'

In [29]:
# import the dataset
df = pd.read_csv('student.csv')

In [30]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [32]:
# number of rows and columns
df.shape

(10, 5)

In [33]:
# names of columns
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [34]:
# first five rows
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes

In [36]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

##### Slicing  data

In [38]:
x = df.iloc[2:7, 1:4]

In [39]:
x

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34

In [40]:
df.iloc[:, 1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75
9    anmol    BE  78.66

In [41]:
df.iloc[2:7, :]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19

In [42]:
df.iloc[[1,4,6,7,9], 1:4]

    name class  marks
1   amit    TE  59.77
4   asha    TE  63.28
6   amar    BE  65.34
7  amita    BE  68.33
9  anmol    BE  78.66

In [44]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [45]:
df.drop('class', axis = 1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [46]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [47]:
df[['roll','name','marks']]

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

##### Functions on data

In [49]:
df['marks'].min()

49.55

In [50]:
df['marks'].max()

78.66

In [51]:
df['marks'].mean()

64.499

In [53]:
df['marks'].sum()

644.9899999999999

In [54]:
df['marks'].median()

64.31

##### Custom Column Operations

In [56]:
df['roll'] = df['roll'] + 100

In [57]:
df

   roll     name class  marks  age
0   101     anil    TE  56.77   22
1   102     amit    TE  59.77   21
2   103   aniket    BE  76.88   19
3   104  ajinkya    TE  69.66   20
4   105     asha    TE  63.28   20
5   106   ayesha    BE  49.55   20
6   107     amar    BE  65.34   19
7   108    amita    BE  68.33   23
8   109     amol    TE  56.75   20
9   110    anmol    BE  78.66   21

In [58]:
df['marks'] = df['marks'] + 0.45

In [59]:
df

   roll     name class  marks  age
0   101     anil    TE  57.22   22
1   102     amit    TE  60.22   21
2   103   aniket    BE  77.33   19
3   104  ajinkya    TE  70.11   20
4   105     asha    TE  63.73   20
5   106   ayesha    BE  50.00   20
6   107     amar    BE  65.79   19
7   108    amita    BE  68.78   23
8   109     amol    TE  57.20   20
9   110    anmol    BE  79.11   21

In [60]:
df['cgpa'] = df['marks'] / 10 + 0.49

In [61]:
df

   roll     name class  marks  age   cgpa
0   101     anil    TE  57.22   22  6.212
1   102     amit    TE  60.22   21  6.512
2   103   aniket    BE  77.33   19  8.223
3   104  ajinkya    TE  70.11   20  7.501
4   105     asha    TE  63.73   20  6.863
5   106   ayesha    BE  50.00   20  5.490
6   107     amar    BE  65.79   19  7.069
7   108    amita    BE  68.78   23  7.368
8   109     amol    TE  57.20   20  6.210
9   110    anmol    BE  79.11   21  8.401

##### Boolean Filtering

In [63]:
df['marks'] >= 60

0    False
1     True
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [64]:
df[df['marks'] >= 60]

   roll     name class  marks  age   cgpa
1   102     amit    TE  60.22   21  6.512
2   103   aniket    BE  77.33   19  8.223
3   104  ajinkya    TE  70.11   20  7.501
4   105     asha    TE  63.73   20  6.863
6   107     amar    BE  65.79   19  7.069
7   108    amita    BE  68.78   23  7.368
9   110    anmol    BE  79.11   21  8.401

In [65]:
x = df[(df['marks'] >= 60) & (df['class'] == 'BE')]

In [66]:
x

   roll    name class  marks  age   cgpa
2   103  aniket    BE  77.33   19  8.223
6   107    amar    BE  65.79   19  7.069
7   108   amita    BE  68.78   23  7.368
9   110   anmol    BE  79.11   21  8.401

##### Export the data

In [68]:
x.to_csv('output.csv', index=False)

In [69]:
x.to_html('output.html', index=False)